In [1]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.40  13
2  2.3  0.45  15

In [2]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
}, index=[2000, 2010, 2020])

df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [3]:
df.index

Index([2000, 2010, 2020], dtype='int64')

In [4]:
df.index = [2001, 2002, 2003]

In [5]:
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.40  13
2003  2.3  0.45  15

In [6]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [7]:
df.columns = ["일본", "필리핀", "러시아"]

In [8]:
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.40   13
2003  2.3  0.45   15

In [9]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.4 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [16]:
import pandas as pd

df = pd.DataFrame({
    "년도": [2000, 2010, 2020],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [17]:
df = df.set_index("년도")
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [18]:
df.index.name

'년도'

In [19]:
df.index.name = "연도"

In [20]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [21]:
df = df.reset_index("연도")
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [22]:
df = df.set_index("연도")
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [23]:
df.loc[2000] #실제 인덱스 명을 활용해서 인덱스에 해당하는 값 = 행(record) 값을 찾아올 때 사용

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [24]:
df.iloc[0] #인덱스 이름이 아닌, 인덱스의 연번=순번을 기준으로 record의 값을 찾아올 때 사용

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [25]:
type(df.loc[2000])

pandas.core.series.Series

In [26]:
df["미국"]

연도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [27]:
type(df["미국"])

pandas.core.series.Series

In [29]:
print(df["미국"][2010])

2.2

In [31]:
print(df.loc[2010]["미국"])

2.2

In [32]:
import pandas as pd

df = pd.DataFrame({
    "년도": ["2000", "2010", "2020"],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [33]:
df = df.set_index("년도")

In [34]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [35]:
df.index

Index(['2000', '2010', '2020'], dtype='object', name='년도')

In [37]:
df.loc["2000"]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [39]:
df["미국"]

년도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [40]:
df["일본"] = [1, 2, 3]

In [41]:
df

       미국    한국  중국  일본
년도
2000  2.1  0.40  10   1
2010  2.2  0.40  13   2
2020  2.3  0.45  15   3

In [42]:
del df["일본"]

In [43]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [44]:
df.loc[2021] = [1, 2, 3]

In [45]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [47]:
df.drop(["2021"])
df

KeyError: "['2021'] not found in axis"

In [50]:
df.drop(['2020'])

       미국   한국  중국
년도
2000  2.1  0.4  10
2010  2.2  0.4  13
2021  1.0  2.0   3

In [51]:
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [54]:
df.drop(['2020'], inplace=True) # drop => 임시삭제,

In [55]:
df

       미국   한국  중국
년도
2000  2.1  0.4  10
2010  2.2  0.4  13
2021  1.0  2.0   3

In [56]:
df2 = df[["중국", "한국"]].copy()

In [57]:
df2

      중국   한국
년도
2000  10  0.4
2010  13  0.4
2021   3  2.0

In [58]:
df2.columns = ["브라질", "아르헨티나"]

In [59]:
df2

      브라질  아르헨티나
년도
2000   10    0.4
2010   13    0.4
2021    3    2.0

In [60]:
df

       미국   한국  중국
년도
2000  2.1  0.4  10
2010  2.2  0.4  13
2021  1.0  2.0   3